gustavowd/FreePMU/STM32F769_EWizard/Src/tarefasPMU.c
	// 6. DATA = qualquer coisa
	ucData[14] = (unsigned char)(1);
	ucData[15] = (unsigned char)(2);
	ucData[16] = (unsigned char)(3);
	ucData[17] = (unsigned char)(4);

	//21. CRC-CCITT = Calcula o CRC

	CRC_CCITT = ComputeCRC(ucData, 19);

	ucData[18] = (unsigned char)((CRC_CCITT & 0xFF00) >> 8);
	ucData[19] = (unsigned char)(CRC_CCITT & 0x00FF);

	return 19+1;
}

//Callback chamado quando o ADC finaliza a conversão
void HAL_ADC_ConvCpltCallback(ADC_HandleTypeDef* hadc){
#ifdef PPS_30_HZ
	//Interrompe o TIM1 e zera sua contagem atribuindo 0 ao Auto Reload Register
	htim1.Instance->CR1 &= ~(TIM_CR1_CEN);
	htim1.Instance->CNT = 0;

	BSP_LED_Toggle(LED1);

	//HAL_GPIO_TogglePin(GPIOF, GPIO_PIN_6);

	osSemaphoreRelease(pmuSem_id);
#else
	//Interrompe o TIM8 e zera sua contagem atribuindo 0 ao Auto Reload Register
	htim8.Instance->CR1 &= ~(TIM_CR1_CEN);
	htim8.Instance->CNT = 0;

	BSP_LED_Toggle(LED1);

	// Se for a primeira aquisição...
	if (trigcount == 0) {
		// Configura o TIM8 para ser trigado pelo TIM1 (ITR0)
		TIM_SlaveConfigTypeDef sSlaveConfig;
		sSlaveConfig.SlaveMode = TIM_SLAVEMODE_TRIGGER;
		sSlaveConfig.InputTrigger = TIM_TS_ITR0;
		sSlaveConfig.TriggerPolarity = TIM_TRIGGERPOLARITY_NONINVERTED;
		sSlaveConfig.TriggerPrescaler = TIM_TRIGGERPRESCALER_DIV1;
		sSlaveConfig.TriggerFilter = 0;
		HAL_TIM_SlaveConfigSynchronization(&htim8, &sSlaveConfig);

		/*Inicializa o TIM1*/
		//todo: verificar
		//htim1.Instance->CR1 |= (TIM_CR1_CEN);

		newSOC = 0;
		trigcount++;
	}
	// Do contrario, o TIM8 j� est� iniciado
	else {
		//Ent�o conta-se um pulso
		trigcount++;

		if (trigcount > 29) {
			// Caso o n�mero de pulsos-1 tenha sido atingido, o TIM1 � interrompido
			htim1.Instance->CR1 &= ~(TIM_CR1_CEN);
			htim1.Instance->CNT = 0;

			// O TIM8 � reestabelecido para ser disparado externamente
			TIM_SlaveConfigTypeDef sSlaveConfig;
			sSlaveConfig.SlaveMode = TIM_SLAVEMODE_TRIGGER;
			sSlaveConfig.InputTrigger = TIM_TS_ETRF;
			sSlaveConfig.TriggerPolarity = TIM_TRIGGERPOLARITY_NONINVERTED;
			sSlaveConfig.TriggerPrescaler = TIM_TRIGGERPRESCALER_DIV1;
			sSlaveConfig.TriggerFilter = 0;
			HAL_TIM_SlaveConfigSynchronization(&htim8, &sSlaveConfig);

			// E a contagem de pulsos zerada
			trigcount = 0;
		}
	}

	osSemaphoreRelease(pmuSem_id);
#endif
}
